def findThreeNumbers(A, arr_size, sum): 

	# Сортуємо стандартним пайтонівським методом
	A.sort() 

	# Перебираємо для обраного елемента інші
	for i in range(0, arr_size-2): 

		# Аби знайти інші два елемента, починаємо з індексів, які є крайніми(перший і останній) і поступово рухаємось до середини
		
		# індекс першого елемента у масиві тих елементів, які залишились перебрати
		l = i + 1
		
		# індекс останнього елемента
		r = arr_size-1
		while (l < r): 
		
			if( A[i] + A[l] + A[r] == sum): 
				print("YES(", A[i], 
					', ', A[l], ', ', A[r], ")"); 
				return True
			# сума трьох обраних елементів менша за необхідно, тому +1 до лівого індекса
			elif (A[i] + A[l] + A[r] < sum): 
				l += 1
			else: # A[i] + A[l] + A[r] > sum сума трьох обраних елементів більша за необхідно, тому -1 до правого індекса
				r -= 1

	# Якщо аж сюди цикл дойде, то ніфіга не знайдено
	return False

A = [1, 2, 3] 
sum = 6
arr_size = len(A) 

findThreeNumbers(A, arr_size, sum) 